{
    "What is late blight disease?": "Late blight disease is a destructive plant disease caused by the oomycete pathogen Phytophthora infestans. It affects a wide range of plants, including potatoes and tomatoes.",
    "What are the common symptoms of late blight?": "Late blight is characterized by dark, water-soaked lesions on leaves, stems, and fruit. These lesions can rapidly expand, leading to defoliation.",
    "How does late blight spread in plants?": "Late blight spreads through spores produced on infected plant debris and can be carried by wind, rain, or irrigation water. It can also be introduced to new plants through infected seed potatoes.",
    "Are there resistant potato and tomato varieties to late blight?": "Yes, there are potato and tomato varieties that are resistant to late blight. Planting these resistant cultivars can significantly reduce disease severity.",
    "What are the management strategies for late blight?": "Management strategies for late blight include using resistant cultivars, practicing crop rotation, applying fungicides preventively, early detection, and proper sanitation.",
    "How can farmers monitor and detect late blight in their crops?": "Farmers can monitor and detect late blight by regularly inspecting plants for the characteristic symptoms of the disease. Early detection allows for timely action.",
    "Can late blight infect tubers in potatoes?": "Yes, late blight can infect potato tubers, causing rot. Infected tubers are not suitable for consumption.",
    "What is the economic impact of late blight in agriculture?": "Late blight can have a significant economic impact on agriculture, leading to reduced yields and increased production costs due to the need for fungicide applications.",
    "nestle maggie?": "A very bad product, once caught red handed for its lead amount!!",
    "maggie": "Maggie is made up of maida and is not good for health.",
    "nuclear fusion": "A nuclear reaction which can lead to disaster.",
    "What is your gender?": "I am not a living being. I am just a chat bot to help you anytime.",
    "Provide your gender?": "I am not a living being. I am just a chat bot to help you anytime.",
    "Oo nice": "Thanks",
    "Aditya Shrivastava?": "A very good boy.",
    "Stuti Gupta?": "A kuttipie bad bad girl!!!"
}